import { NavLink } from "react-router";

const Instruction = () => {
  return (
    <>
      <p className="text-2xl font-bold mb-4">Як працює система?</p>
      <b>1. Додавання кандидатів</b>
      <ul className="mt-1 mb-3">
        <li>
          Кандидатів може додавати лише адміністратор системи, використовуючи
          спеціальний адміністративний код.
        </li>
        <li>Для кожного кандидата вказується ім’я та опис.</li>
        <li>Інші користувачі не можуть додавати кандидатів.</li>
      </ul>
      <b>2. Процес голосування</b>
      <ul className="mt-1 mb-3">
        <li>Кожен користувач отримує унікальний код голосування.</li>
        <li>Код можна використати лише один раз.</li>
        <li>Голосування проводиться за ID кандидата, вказаного в списку.</li>
        <li>
          Після голосування код стає недійсним, а голос додається до загальної
          кількості кандидата.
        </li>
      </ul>
      <b>3. Перевірка результатів</b>
      <ul className="mt-1 mb-3">
        <li>
          Будь-хто може переглянути список кандидатів і кількість голосів за
          кожного.
        </li>
        <li>Неможливо змінити або видалити голоси після голосування.</li>
      </ul>
      <p className="text-2xl font-bold mb-4">Як проголосувати?</p>
      <ul className="mt-1 mb-3">
        <li>1. Отримайте свій унікальний код голосування.</li>
        <li>2. Виберіть кандидата, за якого хочете проголосувати (по ID). </li>
        <li>3. Введіть свій код та підтвердьте голос.</li>
        <li>
          4. Якщо код правильний і ще не використаний, ваш голос буде
          зарахований.
        </li>
      </ul>
      <NavLink to="/">Повернутись</NavLink>
    </>
  );
};

export default Instruction;
